## Datos del Titanic

In [1]:
import seaborn as sns

In [2]:
titanic = sns.load_dataset('titanic')

In [3]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [11]:
titanic.shape

(891, 15)

In [4]:
import numpy as np
import pandas as pd

In [5]:
titanic['survived'] = pd.Categorical(titanic.survived)

In [6]:
titanic.pclass = pd.Categorical(titanic.pclass)

In [16]:
titanic['sex'] = pd.Categorical(titanic['sex'])

## Tablas de contingencia

In [10]:
tab = pd.crosstab(index= titanic['survived'],
                 columns= 'pasajeros')

tab  

# 549 pasajeros no sobrevivieron
# 342 ""    ""  sobrevivieron

col_0     pasajeros
survived
0               549
1               342

In [40]:
titanic.survived.value_counts()

0    549
1    342
Name: survived, dtype: int64

In [44]:
titanic.groupby('survived').count()#['sex']

,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
survived,,,,,,,,,,,,,,
0,549,549,424,549,549,549,549,549,549,549,67,549,549,549
1,342,342,290,342,342,342,340,342,342,342,136,340,342,342

In [36]:
tab / tab.sum()  # frecuencias relativas: el 61.61 % no sobrevivió

col_0     pasajeros
survived
0          0.616162
1          0.383838

In [35]:
(tab / tab.sum()).iloc[1] + (tab / tab.sum()).iloc[0]

col_0
pasajeros    1.0
dtype: float64

In [12]:
type(tab)

pandas.core.frame.DataFrame

In [14]:
pd.crosstab(index= titanic['pclass'],
           columns= 'viajeros') # el nombre de la columna lo creamos nosotros

col_0   viajeros
pclass
1            216
2            184
3            491

In [15]:
pd.crosstab(index= titanic['sex'],
           columns= 'pasajeros')

col_0   pasajeros
sex
female        314
male          577

In [21]:
tab_c = pd.crosstab(index= titanic['deck'],
           columns= 'count')  # no cuenta los nulos

tab_c

col_0  count
deck
A         15
B         47
C         59
D         33
E         32
F         13
G          4

In [19]:
titanic.deck

0      NaN
1        C
2      NaN
3        C
4      NaN
      ...
886    NaN
887      B
888    NaN
889      C
890    NaN
Name: deck, Length: 891, dtype: category
Categories (7, object): [A, B, C, D, E, F, G]

In [23]:
tab_c.sum() # conociamos en que cubierta se hospedaban 203 personas

col_0
count    203
dtype: int64

In [24]:
tab_c.shape

(7, 1)

In [26]:
tab_c.iloc[1:5]

col_0  count
deck
B         47
C         59
D         33
E         32

In [27]:
tab_c/tab_c.sum()  

# Para obtener la tabla de frecuencias relativas, dividimos la tabla de frecuencias absolutas
# entre la suma de frecuencias absolutas, que es el número total de observaciones

col_0     count
deck
A      0.073892
B      0.231527
C      0.290640
D      0.162562
E      0.157635
F      0.064039
G      0.019704

## Tablas de contingencia para 2 variables

In [46]:
survived_sex = pd.crosstab(index = titanic['survived'], 
                          columns = titanic['sex'])

survived_sex.index = ["died", "survived"] # editamos el índice para que se pueda leer mejor 

survived_sex

sex       female  male
died          81   468
survived     233   109

In [51]:
survived_class = pd.crosstab(index = titanic['survived'], 
                          columns = titanic['pclass'],
                            margins= True) # para añadir los marginales

survived_class.index = ["murió", "sobrevivió", "total_clase"]
survived_class.columns = ['Primera', 'Segunda', 'Tercera', "total_supervivientes"]

survived_class

             Primera  Segunda  Tercera  total_supervivientes
murió             80       97      372                   549
sobrevivió       136       87      119                   342
total_clase      216      184      491                   891

## Frecuencias relativas globales

In [53]:
# iloc es por indice
# loc es por nombre de la columa o fila

survived_class/survived_class.loc['total_clase', 'total_supervivientes']

              Primera   Segunda   Tercera  total_supervivientes
murió        0.089787  0.108866  0.417508              0.616162
sobrevivió   0.152637  0.097643  0.133558              0.383838
total_clase  0.242424  0.206510  0.551066              1.000000

### Frecuencia relativas marginales

In [54]:
survived_class/survived_class.loc['total_clase'] # proporcion por clase, columnas

             Primera   Segunda   Tercera  total_supervivientes
murió        0.37037  0.527174  0.757637              0.616162
sobrevivió   0.62963  0.472826  0.242363              0.383838
total_clase  1.00000  1.000000  1.000000              1.000000

In [61]:
# otra forma de sacar la proporción por columnas

survived_class.div(survived_class.loc["total_clase"], axis = 1)

             Primera   Segunda   Tercera  total_supervivientes
murió        0.37037  0.527174  0.757637              0.616162
sobrevivió   0.62963  0.472826  0.242363              0.383838
total_clase  1.00000  1.000000  1.000000              1.000000

In [57]:
survived_class.T/survived_class['total_supervivientes']

                         murió  sobrevivió  total_clase
Primera               0.145719    0.397661     0.242424
Segunda               0.176685    0.254386     0.206510
Tercera               0.677596    0.347953     0.551066
total_supervivientes  1.000000    1.000000     1.000000

In [60]:
# proporción por filas

survived_class.div(survived_class["total_supervivientes"], axis = 0) # para dividir por filas

              Primera   Segunda   Tercera  total_supervivientes
murió        0.145719  0.176685  0.677596                   1.0
sobrevivió   0.397661  0.254386  0.347953                   1.0
total_clase  0.242424  0.206510  0.551066                   1.0

In [59]:
survived_class

             Primera  Segunda  Tercera  total_supervivientes
murió             80       97      372                   549
sobrevivió       136       87      119                   342
total_clase      216      184      491                   891

## Tablas multidimensionales

In [65]:
surv_sex_class = pd.crosstab(index= titanic['survived'],
                            columns= [titanic["sex"], titanic["pclass"]],
                            margins= True)

surv_sex_class

sex      female          male            All
pclass        1   2    3    1    2    3
survived
0             3   6   72   77   91  300  549
1            91  70   72   45   17   47  342
All          94  76  144  122  108  347  891

In [66]:
surv_sex_class['female']

pclass     1   2    3
survived
0          3   6   72
1         91  70   72
All       94  76  144

In [67]:
# Si queremos filtarr por más de una columna, tenemos que seguir el orden de estas (sex , pclass)

surv_sex_class['female'][1]  

# mujeres de 1era clase murieron 3, y se salvaron 91 de un total de 94

survived
0       3
1      91
All    94
Name: 1, dtype: int64

In [68]:
surv_sex_class/surv_sex_class.loc['All'] # frecuencias relativas por columna

sex         female                     male                           All
pclass           1         2    3         1         2         3
survived
0         0.031915  0.078947  0.5  0.631148  0.842593  0.864553  0.616162
1         0.968085  0.921053  0.5  0.368852  0.157407  0.135447  0.383838
All       1.000000  1.000000  1.0  1.000000  1.000000  1.000000  1.000000

Ser mujer y viajar en primera y segunda clase fué muy favorable de cara a la supervivencia.
Por contra, ser varón y viajar en tercera y segunda, fué una condición fatal.